# Проект FitLife - MVP версия 1.0


# 1. Знакомство
# TODO: Спроси у пользователя имя и сохрани в переменную user_name
# TODO: Спроси возраст и сохрани в переменную user_age
# (не забудь преобразовать в число)
print("Привет! Я бот FitLife — помогу тебе следить за здоровьем.")
user_name = input("Привет! Как тебя зовут? ")
user_age = int(input("Сколько тебе лет? "))


# 2. Сбор данных
# TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
# TODO: Запроси рост (в метрах, например 1.75) и сохрани
# в user_height (тип float)
user_weight = float(input("Введи свой вес в кг (например, 55.5 кг.): "))
user_height = float(input("Введи свой рост в метрах (например, 1.77 м.): "))


# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# TODO: Рассчитай bmi (Индекс массы тела)
bmi = user_weight / (user_height ** 2)
bmi = round(bmi, 1)


# Подсчет воды: вес * 30 мл
# TODO: Рассчитай water_needed
water_needed = user_weight * 30


# 4. Вывод красивого результата
# TODO: Используй f-строку, чтобы вывести приветствие, например:
# "Привет, Иван!"
# TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.
print(f"Отчет для пользователя: {user_name} ({user_age} г.)")
print(f"Твой Индекс массы тела: {bmi}")
print(f"Рекомендуемая норма воды: {round(water_needed / 1000, 1)} л. в день")
print()
print("Расчет окончен. Будьте здоровы!")
